{
  "Analyzing": "Analyzing  refers to the activity of examining any kind of information from collections of data, of discovering recurring phenomena, units, elements, patterns, groupings, and the like. This can refer to structural, formal or semantic aspects of data.",
  "Content Analysis": "Content analysis includes researching/studying aspects of objects relating to their meaning, such as identifying concepts or meaningful units.",
  "Discourse Analysis": "Generic term for the analysis of social, language policy or historiographical discourse phenomena.",
  "Identifying": "Identifying refers to the activity of naming and/or assigning (possibly unique and/or persistent) identifiers such as a word, number, letter, symbol, or any combination to objects of enquiry or to any kind of digital object.",
  "Digital Object Identifier": "Character string used as a permanent identifier for a digital object, in a format controlled by the international doi foundation.",
  "Identifier": "Name that identifies either a unique object or a unique class of objects.",
  "Naming Convention": "Set of rules for naming variables, types, functions, etc. in programming.",
  "Persistent Identifier": "Long-lasting digital name.",
  "Uniform Resource Identifier": "String of characters used to identify a name of a resource on a network such as the internet.",
  "Information Retrieval": "Activity of obtaining information resources relevant to an information need from a collection of information resources.",
  "Machine Learning": "Branch of statistics and computer science, which studies algorithms and architectures that learn from observed facts.",
  "Named Entity Recognition": "Extraction of named entity mentions in unstructured text into pre-defined categories.",
  "Sentiment Analysis": "Use of natural language processing, text analysis and computational linguistics to identify and extract subjective information in source materials.",
  "Tagging": "The act of labelling a piece of data or content wth a short string to express some metadata.",
  "Topic Modeling": "Set of techniques in computational linguistics and related fields.",
  "Network Analysis": "Network analysis is a method to study the relations of (real or fictional) actors or other entities in a mediated network, which can take the form of a social or academic online network, a set of correspondence, or a work of literature. The resulting network is made up of nodes (entities) and edges (relations).",
  "Relational Analysis": "Relational analysis refers to computational techniques serving to discover specific relations between several objects of study. In textual studies, this could mean discovering overlap between different texts (e.g. text reuse or  plagiarism), or comparison of texts variations regarding completeness and correctness (e.g. collation), or assessing the similarity of texts in terms of stylistic features (e.g. stylometry). By analogy, such methods can also be applied to other cultural artefacts, such as music, film or painting.",
  "Cluster Analysis": "Task of grouping a set of objects in such a way that objects in the same group (called a cluster) are more similar (in some sense or another) to each other than to those in other groups (clusters).",
  "Collating": "Collating describes the activity of comparing two or more versions of written or spoken natural language data by aligning them into alphabetical or numerical order to identify similarities and differences.",
  "Comparing": "Not defined.",
  "Pattern Recognition": "Branch of machine learning.",
  "Principal Component Analysis": "Conversion of a set of observations of possibly correlated variables into a set of values of linearly uncorrelated variables called principal components.",
  "Sequence Alignment": "Process in bioinformatics that aligns (identifies equivalent sites within) molecular sequences.",
  "Stylometry": "Stylometry refers to research methods and techniques for analyzing, characterizing and comparing writing styles to determine authorship via statistical probability. A typical stylometric approach is based on the observation the frequency of occurrence of individual words, length of sentences, complexity of sentences, frequent words, spelling errors, etc.",
  "Spatial Analysis": "Spatial analysis refers to the discovery of trends or patterns in data pertaining to spatial or geographical aspects of the data. Spatial analysis may lead to visualization or modeling in the form of maps.",
  "Georeferencing": "Identification of something to locations in physical space.",
  "Structural Analysis": "Structural analysis involves analysis of dimensions of the language system on the level of the relations between these structural elements such as morphology or syntax.",
  "Collocation Analysis": "Analysis of recurrent co-occurrences of two or more words in language.",
  "Concordance": "List of words or terms in a published book .",
  "POS-Tagging": "The process of identifying the grammatical type of words in a text.",
  "Tree-Tagging": "Not defined.",
  "Stylistic Analysis": "Stylistic analysis consists of identifying stylistic or formal features as a particular variety of digital objects such as language, physical artifacts, painting, music or movies. Computational stylistics analysis is in many cases applied to texts and based on linguistic features.",
  "Authorship Attribution": "Authorship attribution means the theory and method of determining the author of a given piece of work, e.g. a text by appropriate characterization of stylistic and thematic features.",
  "Contrastive Analysis": "Not defined.",
  "Distance Measures": "Definitions for distance between two objects or events in the universe.",
  "Genre Recognition": "Genre recognition refers to methods and technologies for analyzing pieces of art (e.g. literature, music, film), extracting and classifying features to associate them with different genres automatically or semi-automatically.",
  "Rhetorical Analysis": "Not defined.",
  "Text Categorization": "Not defined.",
  "Visual Analysis": "Visual analysis refers to activities to aggregate and graphically represent patterns, structures, trends or points of interest in large and complex data sets using them analytically and making them visually explorable with methods of automatic data analysis in order to gain new insights. Virtually any type of data, information or knowledge can be visualized in static, dynamic or interactive visual formats such as images, maps, timelines, charts or tables, 2d, 3d and the like.",
  "Data Visualization": "Creation and study of the visual representation of data.",
  "Mapping": "Binary relation which is left-total (defined on all its input set).",
  "Mind Mapping": "Not defined.",
  "Plotting": "Not defined.",
  "Capturing": "Capturing generally refers to the activity of creating digital surrogates of real world objects, or expressing existing artifacts in a digital representation. This refers basically to learning and noticing something (as in discovering) and could be enhanced by a manual process (as in transcribing) or an automated procedure (as in imaging, data recognition or recording). This also includes aggregating resources, information and data (as in gathering).",
  "Converting": "Converting refers to changing the file format of an object, e.g. converting a .wmv video to a .mov file or converting vhs into a digital format. A conversion is not lossless and generates a different data format, digital representation, or a different digital object. When converting concerns metadata, it may involve mapping one metadata schema to another.",
  "Compiling": "Translation of code written in a higher-level programming language to a lower-level form.",
  "Lemmatizing": "Not defined.",
  "Natural Language Processing": "Field of computer science and linguistics.",
  "Parsing": "Process of analyzing a string of symbols, either in natural language, computer languages or data structures, conforming to the rules of a formal grammar.",
  "Transcoding": "Direct digital-to-digital conversion of one encoding to another.",
  "Data Recognition": "Data recognition, e.g. optical character recognition (ocr), refers to the process of treating the immediate products of digital data capturing (recording or imaging), such as digital facsimiles of texts or of music score, in a way to extract discrete, machine-readable units from them, such as plain text words, musical notes, still or moving image elements.",
  "Encoding": "Process of creating a message for transmission.",
  "Optical Character Recognition": "Not defined.",
  "Optical Music Recognition": "Not defined.",
  "Preprocessing": "Not defined.",
  "Discovering": "Discovering describes the activity of advanced querying, simple searching and more serendipitous browsing in archives, library catalogs, indexes and abstracts of scholarly journals, web directories, databases and seeking out objects of research, research results, or other information which is useful for a given search interest.",
  "Browsing": "Exploratory use of an information system.",
  "Exploration": "Act of searching or traveling around a terrain for the purpose of discovery.",
  "Querying": "Not defined.",
  "Searching": "Search for target data from a set of data.",
  "Extracting": "Extracting refers to the process to distill structured information from texts, images or other machine-readable digital documents of a certain domain not necessarily in a human understandable form. Information extraction, knowledge extraction, knowledge discovery, information mining and data mining are methodologically similar. The activity of extracting also concerns processing human language texts by means of natural language processing (nlp).",
  "Data Mining": "Process of discovering patterns in large data sets using computational methods at the intersection of statistics, database systems, or machine learning.",
  "Information Mining": "Not defined.",
  "Knowledge Discovery": "Not defined.",
  "Knowledge Extraction": "Creation of knowledge from structured and unstructured sources.",
  "Gathering": "Gathering refers to aggregating discovered resources, usually in some structured way (e.g. bringing together all papers that address a certain topic, as part of a literature review, or pulling all works by a particular author out of a digital collection for further analysis).",
  "Aggregating": "Act of collecting together physical or conceptual objects.",
  "Archiving": "Archiving includes the process of moving data and other resources to a separate space for retention. If long-term archiving is involved, activities related to data preservation may also be involved.",
  "Cataloging": "Process of listing information resources for inclusion in a database.",
  "Collecting": "Purposefully gathering items.",
  "Data Ingestion": "Not defined.",
  "Scanning": "Process of creating digital images with a scanner.",
  "Web Scraping": "Data scraping used for extracting data from websites.",
  "Preserving": "Preserving refers to the application of specific strategies, activities and technologies for the purpose of ensuring an accurate rendering of digital content over time. It facilitates the reuse of research data, objects, and related resources and may include activities related to sustainability and interoperability.",
  "Bit Stream Preservation": "Not defined.",
  "Description": "Text for clarification; one of four rhetorical modes.",
  "Emulation": "System that emulates a real system such that the behavior closely resembles the behavior of the real system.",
  "Migration": "Process of selecting, preparing, extracting, and transforming data and permanently transferring it from one computer storage system to another.",
  "Preservation Metadata": "Information that supports and documents acts of preservation on digital materials.",
  "Replication": "Sharing information to ensure consistency in computing.",
  "Versioning": "Versioning comprises the management of different but improved and optimized models, releases or parts of a product or work (e.g. document, websites or software) by archiving, referencing and documenting of the changes in these different versions.",
  "Web Crawling": "Systematic access of resources across the web.",
  "Imaging": "Imaging refers to capturing texts, images, artifacts or spatial formations in 2d or 3d using optical or acoustic means (light, laser, infrared, ultrasound). imaging usually does not lead to the identification of discrete semantic or structural units in the data, such as words or musical notes.",
  "Photographing": "Art, science, and practice of creating durable images by recording light or other electromagnetic radiation.",
  "Recording": "Recording refers to capturing audio and/or video. The  result is a digital audio (e.g. wav, mp3, etc.) or video (e.g. mp4, quicktime, etc.) file that can be manipulated, analyzed and/or stored.",
  "Audio Recording": "Mechanical or digital record of a series of audio events.",
  "Screencast": "Digital recording of computer screen output.",
  "Video Capture": "Not defined.",
  "Transcribing": "Transcribing describes  the activity of creating a representation of a manuscript or of audio or video recordings. The representation is generally textual for the verbal aspects of recordings and structured for example by speech turns. It can also contain multimodal information like gestures or events and multimedia information like time synchronization and relation to media files.",
  "Speech Recognizing": "Not defined.",
  "Creating": "Creating generally refers to an achievement of producing born-digital objects as an own contribution, rather than creating an output by capturing and digitizing existing analog objects or enrichment of information. Creating can involve writing or translating natural language texts or could also concern other forms of expressions, such as creating an executable code (programming), composing a musical score, creating an image, or developing any design (designing) for any media or implementing these design concepts (web development).",
  "Designing": "Designing refers to the development of a user or a graphical interface, with which the user is able to interact to perform various tasks and conduct activities. Also included here is the development of the user experience, user interaction, participation and usability aspects where a person’s perceptions and needs of the practical dimensions such as utility, ease of use, and efficiency of the system are taken into consideration.",
  "Diagramming": "Not defined.",
  "Drawing": "Visual artwork in two-dimensional medium.",
  "Wireframing": "Not defined.",
  "Programming": "Programming describes the process of creating executable code for a computer including scripts or application software. Often programming comprises pseudo coding and editing ac source code or algorithm and is varying for different programming languages.",
  "Graphics Programming": "Not defined.",
  "Pseudo Coding": "Pseudo coding refers to the basic process of breaking complex problems into modular algorithms and logical procedures described in plain text. It primarily aims at human readability.",
  "Translating": "Translating involves generating a new linguistic object based on a natural languages source document but written in a different language than the source.",
  "Web Development": "Web development refers to the creation of websites by writing html/css, or other scripting languages, and building or configuring  a platform, content management system or framework such as drupal, wordpress, bootstrap, or omeka, but also includes creating digital assets for browser-based applications.",
  "Writing": "Writing designates the activity of creating new texts (instead of capturing existing text). Here, it primarily concerns research papers and reports, but may include other textually-oriented objects.",
  "Lettering": "Creation of hand-drawn letters in graphic design and typography.",
  "Disseminating": "Disseminating refers to the activity of making objects of inquiry, results of research, or software and services available to fellow researchers or the wider public in a variety of more or less formal ways. It builds on or requires storing and can include releasing (publishing and commenting) and sharing (collaborating, crowdsourcing, and communicating) of data using a variety of methods and techniques including the application of linked open data.",
  "Collaborating": "Collaborating  is involved in any research activity being done jointly by several researchers, possibly in different places and at different times. Research-oriented collaboration is enabled, particularly, through comprehensive digital research environments, but can also happen around more specific activities, such as communication or sharing of resources.",
  "Discussing": "Not defined.",
  "Organizing": "Organizing refers to the arrangement of objects (research materials, data sets, images, etc.) in a way that facilitates other research activities. May also include activities that support discovery such as metadata creation and enhancement.",
  "Finding": "Not defined.",
  "Managing": "Influence or authority over something; process of directing the operation of a device, system, or process.",
  "Sharing": "Sharing refers to the activity of making objects such as digital information, documents, files, software and other publically findable, accessible, interoperable and reusable according to the fair principles and in the sense of open science through communication channels such as blogs, code sharing sites such as github, social media sites or other web-based services, collaborative and network applications.",
  "Posting": "Content on a social media platform, a forum or a blog.",
  "Upload": "Sending of data from a local system to a remote system.",
  "Social Networking": "The process of building one's group of personal or business contacts.",
  "Commenting": "Commenting is the activity of adding information to a piece of data, usually in a way that separates the data to which the comment is attached and the comment. It usually serves to express some opinion, to add contextual information, or to engage in communication or collaboration with others about the object commented on.",
  "Contextualizing": "Contextualizing  refers to  creating associations between an object of investigation and other, more established or better-understood objects in a relation of geographical, temporal, or thematic proximity to the object of investigation, with the aim of ascribing meaning to that object.",
  "Associate": "Not defined.",
  "Co-Occurrence": "Co-occurrence indicates the semantic proximity or an idiomatic expression of text corpora, based on the statistical-linguistic frequency of occurrence of at least two terms in a certain order.",
  "Integrating": "Not defined.",
  "Semantification": "Semantification refers to the process of identifying and associating explicit information with each other by facing challenges such as ambiguity and formalization of implicit knowledge to improve access, automatically data analysis and reuse.",
  "Expressing Opinion": "Expressing opinion refers to the activity of conveying one's feelings and/or thoughts about something to someone in writing or orally. Hereby existing opinions can be agreed or disagreed with, thus stimulating a discourse.",
  "Communicating": "Communicating refers to the activity of exchanging ideas with other people, primarily, but not exclusively, using linguistic means.",
  "Audio Conferencing": "Not defined.",
  "E-mailing": "Not defined.",
  "Instant Messaging": "Form of communication over the internet.",
  "Microblogging": "Broadcast medium.",
  "Text Messaging": "Act of typing and sending a brief, digital message.",
  "Video Conference": "Type of conference.",
  "Crowdsourcing": "Crowdsourcing refers to the paradigm of user-generated content by an open, large and constantly growing group of contributors in a collaborative and collective web context, applied here to the domain of digital humanities research.",
  "Gamification": "The use of game thinking and game mechanics in non-game contexts to engage users in solving problems.",
  "User Generated Content": "Online content created by users.",
  "Publishing": "Publishing refers to the activity of making any kind of object formally available to the wider public. This can involve objects of research, research data, research results, or tools and services. Publishing can be closed or open access / open source, and research results can be published in print or digital formats.",
  "Academic Publishing": "Subfield of publishing which distributes academic research and scholarship.",
  "Blogging": "Action of writing articles or maintaining a weblog.",
  "Digital Publishing": "Not defined.",
  "Linked Open Data": "Linked data available under an open license.",
  "Tweet": "Individual post on the twitter microblogging service.",
  "Teaching": "Teaching refers to the activity of actively imparting knowledge, competences or skills.",
  "Enriching": "Enriching refers to the activity of annotating, editing, or cleaning information to an object of enquiry, by making its origin, nature, structure, meaning, or elements explicit.",
  "Annotating": "Annotating  refers to the activity of making information about a digital object explicit by adding notes, metadata, keywords, tags or links to a digitized representation or to an annotation file associated with it. This can be in the form of explanatory annotations that comments or contextualize a passage, annotations that make structural or linguistic information explicit, as linked open data making the relationships between objects machine-readable, or in the case of general metadata, adding information about the object as a whole.",
  "Associating": "Not defined.",
  "Audio Annotation": "Not defined.",
  "Highlighting": "Not defined.",
  "Segmenting": "Segmenting refers to a management process or method of dividing something into smaller homogeneous parts/units to gain better understanding about an object or topic. Segmentation can range from demographic, geographical, ethical, behavioral, visual, linguistic, musical to other areas and can be multi-dimensional.",
  "Visual Annotation": "Not defined.",
  "Data Cleansing": "Data cleansing involves improving the quality of an existing digital object. this could include correcting errors in a written text, errors in ocr results or  debugging code.",
  "Correcting": "Not defined.",
  "Debugging": "The process of finding and resolving defects or problems within a computer program that prevent correct operation of computer software or a system.",
  "Improving": "Process of a thing moving from one state to another that is considered to be better, usually through some action intended to bring about that better state.",
  "Removing": "Dissociation of the original object with its old part; moving an object on distance of disconnect; process of moving, or the fact of being removed.",
  "Editing": "Editing refers to adding, correcting, condensating, organizing or in other form modifying information of a specific object with the intention to complete and finalize it by making structural, layout-related, semantic, or other scholarly explicit inline or stand-off markup.",
  "Adding": "Arithmetic operation.",
  "Cropping": "To remove unwanted outer parts of an image.",
  "Formatting": "Not defined.",
  "Merging": "Not defined.",
  "Modifying": "Not defined.",
  "Subtracting": "Not defined.",
  "Supplementing": "Not defined.",
  "Video Editing": "Editing live television and video production.",
  "Interpreting": "Interpreting is the activity of explaining and ascribing the intended meaning to phenomena observed in analysis. Therefore, interpretation usually follows analysis, although it could also be considered that interpretation defines the hermeneutic perspective of any method of analysis. It refers to processes opening up the discussed phenomenon to a wider debate (contextualisation), of deductive and inductive reasoning (theorizing), or  formalizing specific aspects (modeling).",
  "Modeling": "Modeling refers to creating an abstract representation of a complex phenomenon, usually in a machine-readable way, possibly in an interactive way (i.e. it includes “simulation”). Models become machine-readable when modeling produces a schema that describes the elements and the structure of an object of inquiry in an explicit way. Further it refers to the activity of transforming or manipulating a digital object in such a way as to make it compatible with a previously constructed model or schema.",
  "Data Mapping": "Process of linking data objects in distinct models.",
  "Transformation": "Process involving change into a qualitatively different form.",
  "Theorizing": "Theorizing is a method which aims to relate a number of elements or ideas into a coherent system based on some general principles and capable of explaining relevant phenomena or observations that can be tested. Theorizing can take different forms while a theory may be implemented in the form of a model, or a model may give rise to formulating a theory.",
  "Abstract Thinking": "Not defined.",
  "Conceptualizing": "Conceptualizing means the simplification, specification and formalization of an abstract idea, principle or part of the world in mind, speech, text or even in images. This design activity initially focuses on developing a common understanding of projects, topics, objects and elements and their relationship to one another.",
  "Defining": "Statement that attaches a meaning to a term.",
  "Explanation": "Set of statements constructed to describe a set of facts.",
  "Reasoning": "Type of thought.",
  "Storing": "Storing refers to the activity of making digital copies of objects of inquiry, results of research, software and services, or any media keeping (preserving) them long-term accessible (archiving), without necessarily making them available to the public. This includes management activities (organizing) and processes of identifying the resource."
}